# Pandas DataFrame’lerinde Multi-İndex Ve İndex Hiyerarşisi

In [3]:
import numpy as np
import pandas as pd

In [5]:
inside = ["class-A","class-B","class-C","class-A","class-B","class-C"]

In [7]:
outside = ["School-1","School-1","School-1","School-2","School-2","School-2"]

In [8]:
zip(outside, inside)

In [10]:
zipped_list = list(zip(outside, inside))
zipped_list

[('School-1', 'class-A'),
 ('School-1', 'class-B'),
 ('School-1', 'class-C'),
 ('School-2', 'class-A'),
 ('School-2', 'class-B'),
 ('School-2', 'class-C')]

In [11]:
multi_index = pd.MultiIndex.from_tuples(zipped_list)

In [13]:
np.random.seed(101)
df_notes = pd.DataFrame(data=np.random.randint(50,100, size=(6,2)), columns=["1st_semester 2st_semester".split()], index=multi_index)

In [14]:
df_notes

                 1st_semester 2st_semester
School-1 class-A           81           61
         class-B           67           56
         class-C           73           61
School-2 class-A           97           59
         class-B           63           90
         class-C           54           90

In [21]:
# Örnek-2:

In [22]:
brand = ["AUDI A7","BMW 525 XDrive","WW Passat","Toyota Corolla","Land Rover Discovery","Chevrolet Captiva","TOGG T10X","Chery Tiggo8 Pro Max"]

In [23]:
types = ["Automobile","Automobile","Automobile","Automobile","SUV","SUV","SUV","SUV"]

In [24]:
zip(types, brand)

In [25]:
multi_car = list(zip(types, brand))

In [26]:
multicar_index = pd.MultiIndex.from_tuples(multi_car)

In [27]:
df_carspeeds = pd.DataFrame(data=np.random.randint(260,330, size=(8,2)), columns=["Max_Speed","Price"], index=multicar_index)

In [28]:
df_carspeeds

                                 Max_Speed  Price
Automobile AUDI A7                     320    324
           BMW 525 XDrive              265    272
           WW Passat                   300    309
           Toyota Corolla              268    289
SUV        Land Rover Discovery        319    294
           Chevrolet Captiva           304    279
           TOGG T10X                   270    260
           Chery Tiggo8 Pro Max        268    322

In [29]:
df_carspeeds

                                 Max_Speed  Price
Automobile AUDI A7                     320    324
           BMW 525 XDrive              265    272
           WW Passat                   300    309
           Toyota Corolla              268    289
SUV        Land Rover Discovery        319    294
           Chevrolet Captiva           304    279
           TOGG T10X                   270    260
           Chery Tiggo8 Pro Max        268    322

In [30]:
df_carspeeds.Price.iloc[[2]]

Automobile  WW Passat    309
Name: Price, dtype: int32

In [31]:
df_carspeeds["Max_Speed"].loc["SUV"]

Land Rover Discovery    319
Chevrolet Captiva       304
TOGG T10X               270
Chery Tiggo8 Pro Max    268
Name: Max_Speed, dtype: int32

### Multi-İndex'li Pandas DataFrame'lerde Eleman Seçme İşlemi

In [36]:
df_notes

                 1st_semester 2st_semester
School-1 class-A           81           61
         class-B           67           56
         class-C           73           61
School-2 class-A           97           59
         class-B           63           90
         class-C           54           90

In [37]:
df_notes["1st_semester"]

                 1st_semester
School-1 class-A           81
         class-B           67
         class-C           73
School-2 class-A           97
         class-B           63
         class-C           54

In [38]:
df_notes["1st_semester"].loc["School-1"]

        1st_semester
class-A           81
class-B           67
class-C           73

In [39]:
df_notes["1st_semester"].loc["School-1"].loc["class-A":"class-B"]

        1st_semester
class-A           81
class-B           67

In [41]:
df_notes.loc["School-1"].loc["class-A":"class-B"].iloc[:,[1]]

        2st_semester
class-A           61
class-B           56

In [61]:
df_notes.index

MultiIndex([('School-1', 'class-A'),
            ('School-1', 'class-B'),
            ('School-1', 'class-C'),
            ('School-2', 'class-A'),
            ('School-2', 'class-B'),
            ('School-2', 'class-C')],
           )

In [62]:
df_notes.index.names

FrozenList([None, None])

In [63]:
df_notes.index.names = ["Schools","Classes"]

In [64]:
df_notes

                 1st_semester 2st_semester
Schools  Classes
School-1 class-A           81           61
         class-B           67           56
         class-C           73           61
School-2 class-A           97           59
         class-B           63           90
         class-C           54           90

## **xs() Fonksiyonu**


    xs() fonksiyonu, Pandas DataFrame'lerinden belirli bir "kesit" almak için kullanılır.
    Özellikle multi-level; yani çoklu indeks yapılarında çok kullanışlıdır.

    Multi-Index yapılarda indeksleme işlemi yapılırken çıktının DF formatında görülmesi için, xs() fonksiyonu parametresi olan level=0 ilk indeksi; level=1 ile de ikinci indeksi belirterek sonucu DF formatında almamız sağlanır.

In [78]:
df_notes

                 1st_semester 2st_semester
Schools  Classes
School-1 class-A           81           61
         class-B           67           56
         class-C           73           61
School-2 class-A           97           59
         class-B           63           90
         class-C           54           90

In [80]:
df_notes.xs(("School-1","class-C")) # Sonucu Seri formatında aldık.

1st_semester    73
2st_semester    61
Name: (School-1, class-C), dtype: int32

In [83]:
df_notes.xs(("School-1","class-C"),level=[0,1]) # Eğer sonucu DF formatında almak istersek burada olduğu gibi level=[] parametresini kullanmamız gerekir.

                 1st_semester 2st_semester
Schools  Classes
School-1 class-C           73           61

In [86]:
df_notes.xs("class-A", level=1)

         1st_semester 2st_semester
Schools
School-1           81           61
School-2           97           59

In [88]:
df_notes.xs("class-A", level= "Classes")

         1st_semester 2st_semester
Schools
School-1           81           61
School-2           97           59

# Pandas Dataframe’lerini Birleştirme: Concat() Fonksiyonu

In [182]:
df1 = pd.DataFrame({"A":["A0","A1","A2","A3"],
                    "B":["B0","B1","B2","B3"],
                    "C":["C0","C1","C2","C3"],
                    "D":["D0","D1","D2","D3"]
                    }
                   )

In [184]:
df2 = pd.DataFrame({"A":["A4","A5","A6","A7"],
                    "B":["B4","B5","B6","B7"],
                    "C":["C4","C5","C6","C7"],
                    "D":["D4","D5","D6","D7"]
                    }
                   )

In [186]:
df3 = pd.DataFrame({"A":["A8","A9","A10","A11"],
                    "B":["B8","B9","B10","B11"],
                    "C":["C8","C9","C10","C11"],
                    "D":["D8","D9","D10","D11"]
                    }
                   )

In [188]:
df4 = pd.DataFrame({"A":["A12","A13","A14","A15"],
                    "B":["B12","B13","B14","B15"],
                    "X":["X12","X13","X14","X15"],
                    "Y":["Y12","Y13","Y14","Y15"]
                    }
                   )

In [192]:
pd.concat([df1, df2, df3], ignore_index=True, join="inner", axis=0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [195]:
pd.concat([df1, df4], ignore_index=True, join="inner") # df1 ve df4 için concat işleminde join="inner" parametresi ile sadece ortak sütunlardan (kesişim) alt atla birleştirme işlemi yaptık.

     A    B
0   A0   B0
1   A1   B1
2   A2   B2
3   A3   B3
4  A12  B12
5  A13  B13
6  A14  B14
7  A15  B15

In [218]:
pd.concat([df1,df4], join="outer")

     A    B    C    D    X    Y
0   A0   B0   C0   D0  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN
0  A12  B12  NaN  NaN  X12  Y12
1  A13  B13  NaN  NaN  X13  Y13
2  A14  B14  NaN  NaN  X14  Y14
3  A15  B15  NaN  NaN  X15  Y15

In [220]:
pd.concat([df1,df4], axis=1, join="outer")

    A   B   C   D    A    B    X    Y
0  A0  B0  C0  D0  A12  B12  X12  Y12
1  A1  B1  C1  D1  A13  B13  X13  Y13
2  A2  B2  C2  D2  A14  B14  X14  Y14
3  A3  B3  C3  D3  A15  B15  X15  Y15

## Pandas Dataframe’lerini Birleştirme: Merge() Fonksiyonu 1

In [225]:
df1 = pd.DataFrame({'employee': ['Julia', 'Marie', 'Adam', 'Nicole'],
                     'department': ['Data Science', 'Web Development', 'Data Science', 'Cyber Security'],
                     'Year': ['2005', '2008', '2011', '2002']})
   
df2 = pd.DataFrame({'employee': ['Nicole', 'Adam', 'Julia', 'Marie'],
                          'country': ['Canada', 'England', 'USA', 'Germany'],
                          'salary': ['22000', '16000', '20000', '17500']})

In [232]:
df1

  employee       department  Year
0    Julia     Data Science  2005
1    Marie  Web Development  2008
2     Adam     Data Science  2011
3   Nicole   Cyber Security  2002

In [234]:
df2

  employee  country salary
0   Nicole   Canada  22000
1     Adam  England  16000
2    Julia      USA  20000
3    Marie  Germany  17500

In [242]:
pd.merge(df1, df2) # pd.merge() fonksiyonu, df1 ve df2 arasında yer alan ortak sütun ve sütun değerlerini otomatik olarak algılayarak daha profesyonel bir şekilde birleştirme işlemi yaptı.
                   # pd.merge() fonksiyonu, birleştirme işlemlerinde birleştirmenin hangi değere göre nasıl yapılacağını otomatik olarak algılamaktadır.

  employee       department  Year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

### **NOT:**

    # pd.merge() fonksiyonu ile df1 ve df2 nin birleştirilme işleminde fonksiyon parametresi olan on="employee" ile ifadeler içerisinde yer alan ortak sütunu seçerek birleştirme işlemini yapmış olduk.Buradaki DF yapılarında sadece bir tane ortak sütun olduğu için on="employee" parametresini yazmasak da zaten ortak olan tek sütun "employee" olduğu için kendisi default olarak birleştirme işlemini bu ortak sütuna göre yapacaktı.Ancak DF ler içerisinde birden fazla ortak sütun varsa, on="" parametresi bize ortak sütunlardan spesifik olarak hangisi ile birleştirme işlemini seçme şansı sunar.

    how="" parametresi ise pd.merge() fonksiyonu içerisine yazılan DF yapılarından hangisini baza alarak birleştirme işlemi yapacağımızı bize seçme imkanı verir.
    Eğer how="right" şeklinde parametre değerini tanımlarsak pd.merge() içerisine yazılan ve sağ tarafta kalan DF i baza alarak birleştirme işlemi yapacaktır.Eğer how="left" şeklinde parametre değerini tanımlarsak pd.merge() içerisine yazılan ve sol tarafta kalan DF i baza alarak birleştirme işlemi yapacaktır.

    Aşağıdaki pd.merge(df1, df2, on="employee", how="right") şeklindeki fonksiyon tanımlaması ile df1 ve df2 arasında df2 yi baza alarak ortak sütun olan "employee" üzerinden bir birleştirme işlemi yapmış olduk.

In [245]:
pd.merge(df1, df2, on="employee", how="right")

  employee       department  Year  country salary
0   Nicole   Cyber Security  2002   Canada  22000
1     Adam     Data Science  2011  England  16000
2    Julia     Data Science  2005      USA  20000
3    Marie  Web Development  2008  Germany  17500

## Pandas Dataframe’lerini Birleştirme: Merge() Fonksiyonu 2

In [260]:
df1 = pd.DataFrame({'employee': ['Julia', 'Marie', 'Adam', 'Nicole'],
                     'department': ['Data Science', 'Web Development', 'Data Science', 'Cyber Security'],
                     'Year': ['2005', '2008', '2011', '2002']})
   
df2 = pd.DataFrame({'employee': ['Nicole', 'Adam', 'Julia', 'Marie'],
                          'country': ['Canada', 'England', 'USA', 'Germany'],
                          'salary': ['22000', '16000', '20000', '17500']})

In [263]:
df3 = pd.DataFrame({'manager': ['Abraham', "Joseph", "Kayra"],
                     'department': ['Web Development','Cyber Security', 'Data Science']})

In [265]:
df3

   manager       department
0  Abraham  Web Development
1   Joseph   Cyber Security
2    Kayra     Data Science

In [272]:
df4 = pd.merge(df1, df2)

In [274]:
df4

  employee       department  Year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [289]:
pd.merge(df3, df4, on="department", how="right")

   manager       department employee  Year  country salary
0    Kayra     Data Science    Julia  2005      USA  20000
1  Abraham  Web Development    Marie  2008  Germany  17500
2    Kayra     Data Science     Adam  2011  England  16000
3   Joseph   Cyber Security   Nicole  2002   Canada  22000

In [291]:
pd.merge(df4, df3, on="department", how="right")

  employee       department  Year  country salary  manager
0    Marie  Web Development  2008  Germany  17500  Abraham
1   Nicole   Cyber Security  2002   Canada  22000   Joseph
2    Julia     Data Science  2005      USA  20000    Kayra
3     Adam     Data Science  2011  England  16000    Kayra

In [293]:
df5 = pd.merge(df4, df3, on="department", how="right")

In [296]:
df6 = pd.DataFrame({'department': ['Web Development','Web Development', 'Cyber Security', 'Cyber Security',
                                         'Data Science','Data Science'],
                          'prog_lang': ['HTML', 'CSS', 'C++', 'SQL', 'PYTHON', "R"],})

In [309]:
pd.merge(df5, df6)

  employee       department  Year  country salary  manager prog_lang
0    Marie  Web Development  2008  Germany  17500  Abraham      HTML
1    Marie  Web Development  2008  Germany  17500  Abraham       CSS
2   Nicole   Cyber Security  2002   Canada  22000   Joseph       C++
3   Nicole   Cyber Security  2002   Canada  22000   Joseph       SQL
4    Julia     Data Science  2005      USA  20000    Kayra    PYTHON
5    Julia     Data Science  2005      USA  20000    Kayra         R
6     Adam     Data Science  2011  England  16000    Kayra    PYTHON
7     Adam     Data Science  2011  England  16000    Kayra         R

## Pandas Dataframe’lerini Birleştirme: Merge() Fonksiyonu 3

In [319]:
df1 = pd.DataFrame({'employee': ['Julia', 'Marie', 'Adam', 'Nicole'],
                     'department': ['Data Science', 'Web Development', 'Data Science', 'Cyber Security'],
                     'Year': ['2005', '2008', '2011', '2002']})
   
df2 = pd.DataFrame({'employee': ['Nicole', 'Adam', 'Julia', 'Marie'],
                          'country': ['Canada', 'England', 'USA', 'Germany'],
                          'salary': ['22000', '16000', '20000', '17500']})  

df3 = pd.merge(df1, df2)
df3

  employee       department  Year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [322]:
df4 =pd.DataFrame({'employee': ['Julia', 'Alex', 'Adam', 'Kayra'],
                     'department': ['Data Science', 'Web Development', 'Data Science', 'Cyber Security'],
                     'university': ['harvard', 'hamburg', 'oxford', 'metu']})

In [328]:
df3

  employee       department  Year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [330]:
df4

  employee       department university
0    Julia     Data Science    harvard
1     Alex  Web Development    hamburg
2     Adam     Data Science     oxford
3    Kayra   Cyber Security       metu

In [332]:
pd.merge(df3, df4, on=["employee","department"])

  employee    department  Year  country salary university
0    Julia  Data Science  2005      USA  20000    harvard
1     Adam  Data Science  2011  England  16000     oxford

In [351]:
pd.merge(df4, df3, on=["employee","department"], how="outer")

  employee       department university  Year  country salary
0     Adam     Data Science     oxford  2011  England  16000
1     Alex  Web Development    hamburg   NaN      NaN    NaN
2    Julia     Data Science    harvard  2005      USA  20000
3    Kayra   Cyber Security       metu   NaN      NaN    NaN
4    Marie  Web Development        NaN  2008  Germany  17500
5   Nicole   Cyber Security        NaN  2002   Canada  22000

In [363]:
df3

  employee       department  Year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [366]:
df4

  employee       department university
0    Julia     Data Science    harvard
1     Alex  Web Development    hamburg
2     Adam     Data Science     oxford
3    Kayra   Cyber Security       metu

In [359]:
pd.merge(df3, df4, on = ["employee", "department"], how = "left") # how="left" pr. ile sütun altındaki değerleri, pd.merge() parantezi içerisinde sol tarafta kalan df3 ü baza alarak sıraladı ve birleştirdi.

  employee       department  Year  country salary university
0    Julia     Data Science  2005      USA  20000    harvard
1    Marie  Web Development  2008  Germany  17500        NaN
2     Adam     Data Science  2011  England  16000     oxford
3   Nicole   Cyber Security  2002   Canada  22000        NaN

In [368]:
pd.merge(df3, df4, on = ["employee", "department"], how = "right") # how="right" pr. ile sütun altındaki değerleri, pd.merge() parantezi içerisinde sol tarafta kalan df4 ü baza alarak sıraladı ve birleştirdi.

  employee       department  Year  country salary university
0    Julia     Data Science  2005      USA  20000    harvard
1     Alex  Web Development   NaN      NaN    NaN    hamburg
2     Adam     Data Science  2011  England  16000     oxford
3    Kayra   Cyber Security   NaN      NaN    NaN       metu

## Pandas Dataframe’lerini Birleştirme: Merge() Fonksiyonu 4

In [377]:
df1 = pd.DataFrame({'employee': ['Julia', 'Marie', 'Adam', 'Nicole'],
                     'department': ['Data Science', 'Web Development', 'Data Science', 'Cyber Security'],
                     'Year': ['2005', '2008', '2011', '2002']})
   
df2 = pd.DataFrame({'employee': ['Nicole', 'Adam', 'Julia', 'Marie'],
                          'country': ['Canada', 'England', 'USA', 'Germany'],
                          'salary': ['22000', '16000', '20000', '17500']})  

df3 = pd.merge(df1, df2)
df3

  employee       department  Year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [379]:
df6 = pd.DataFrame({'employee': ['Alex', 'Sergio', 'Orhan', 'Fabian'],
                     'department': ['Data Science', 'Web Development', 'Data Science', 'Cyber Security'],
                     'Year': ['2005', '2009', '2010', '2002'],
                     'country': ['Sweden', 'Poland', 'Turkey', 'France'],
                     'salary': ['21000', '18000', '19500', '22500'],
                     'experience' : ["5", "9","3", "2"]})

In [382]:
df6

  employee       department  Year country salary experience
0     Alex     Data Science  2005  Sweden  21000          5
1   Sergio  Web Development  2009  Poland  18000          9
2    Orhan     Data Science  2010  Turkey  19500          3
3   Fabian   Cyber Security  2002  France  22500          2

In [386]:
pd.merge(df5, df6, on=["department","Year"])

,employee_x,department,Year,country_x,salary_x,manager,employee_y,country_y,salary_y,experience
0,Nicole,Cyber Security,2002,Canada,22000,Joseph,Fabian,France,22500,2
1,Julia,Data Science,2005,USA,20000,Kayra,Alex,Sweden,21000,5

## Pandas Dataframe’lerini Birleştirme: Merge() Fonksiyonu 5

In [13]:
df1 = pd.DataFrame({'employee': ['Julia', 'Marie', 'Adam', 'Nicole'],
                     'department': ['Data Science', 'Web Development', 'Data Science', 'Cyber Security'],
                     'Year': ['2005', '2008', '2011', '2002']})
   
df2 = pd.DataFrame({'employee': ['Nicole', 'Adam', 'Julia', 'Marie'],
                          'country': ['Canada', 'England', 'USA', 'Germany'],
                          'salary': ['22000', '16000', '20000', '17500']})  

df3 = pd.merge(df1, df2)

In [15]:
df3

  employee       department  Year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [11]:
df5 = pd.DataFrame({'member': ['George', 'Marie', 'Nicole', 'Donald'],
                     'family_member': ['4', '5', '1', '3']})

In [17]:
df5

   member family_member
0  George             4
1   Marie             5
2  Nicole             1
3  Donald             3

In [21]:
pd.merge(df3, df5, left_on = "employee", right_on = "member") # df3 ve df5 içerisinde yer alan ortak değerlerin yer aldığı sütunları,her iki df için ayrı ayrı olmak üzere parametreler ile belirtmiş olduk.

  employee       department  Year  country salary  member family_member
0    Marie  Web Development  2008  Germany  17500   Marie             5
1   Nicole   Cyber Security  2002   Canada  22000  Nicole             1

In [29]:
pd.merge(df3, df5, left_on = "employee", right_on = "member", how ="outer") # Yukarıdaki kod blokundan farklı olarak how="outer" yazarak her iki df için birleşimini alarak merge işlemini yapmış olduk.

  employee       department  Year  country salary  member family_member
0     Adam     Data Science  2011  England  16000     NaN           NaN
1      NaN              NaN   NaN      NaN    NaN  Donald             3
2      NaN              NaN   NaN      NaN    NaN  George             4
3    Julia     Data Science  2005      USA  20000     NaN           NaN
4    Marie  Web Development  2008  Germany  17500   Marie             5
5   Nicole   Cyber Security  2002   Canada  22000  Nicole             1

In [32]:
pd.merge(df3, df5, left_on = "employee", right_on = "member", how = "left")

  employee       department  Year  country salary  member family_member
0    Julia     Data Science  2005      USA  20000     NaN           NaN
1    Marie  Web Development  2008  Germany  17500   Marie             5
2     Adam     Data Science  2011  England  16000     NaN           NaN
3   Nicole   Cyber Security  2002   Canada  22000  Nicole             1

In [34]:
pd.merge(df3, df5, left_on = "employee", right_on = "member", how = "right")

  employee       department  Year  country salary  member family_member
0      NaN              NaN   NaN      NaN    NaN  George             4
1    Marie  Web Development  2008  Germany  17500   Marie             5
2   Nicole   Cyber Security  2002   Canada  22000  Nicole             1
3      NaN              NaN   NaN      NaN    NaN  Donald             3

## Pandas Dataframe’lerini Birleştirme: Join() Fonksiyonu

### Tanım:

    **join()** fonksiyonu,DataFrame içerisinde yer alan ortak indeksler üzerinden DF yapılarında birleştirme işlemi yapmamızı sağlayan fonksiyondur.
    join() ile yapılacak DataFrame birleştirme işlemlerinde örtüşen ortak sütunlar olmamalıdır.Aksi halde hata alırız.

In [67]:
import numpy as np
import pandas as pd

In [54]:
df1 = pd.DataFrame({"X":["X0","X1","X2"],
                    "Y":["Y0","Y1","Y2"]},
                   index="A0 A1 A2".split()
                   )

In [56]:
df1

     X   Y
A0  X0  Y0
A1  X1  Y1
A2  X2  Y2

In [62]:
df2 = pd.DataFrame({"Z":["Z0","Z2","Z3"],
                    "T":["T0","T2","T3"]},
                    index="A0 A2 A3".split()
                  )

In [64]:
df2

     Z   T
A0  Z0  T0
A2  Z2  T2
A3  Z3  T3

In [75]:
df1.join(df2) # df1'i baz alarak join() fonks. ile, her iki DF yapsıında da yer alan sütunların olduğu bir birleştirme işlemi yapmış olduk.

     X   Y    Z    T
A0  X0  Y0   Z0   T0
A1  X1  Y1  NaN  NaN
A2  X2  Y2   Z2   T2

### NOT:

    join() fonksiyonu parametresi olan ve öntanımlı değeri join() içerisinde how="left" olan parametre değerini how = "inner" şeklinde yeniden tanımlayarak DF ler arasında yer alan ortak indeksler üzerinden sadece kesişimlerini alarak bir birleştirme işlemi yapmış olduk.

In [77]:
df1.join(df2, how = "inner")

     X   Y   Z   T
A0  X0  Y0  Z0  T0
A2  X2  Y2  Z2  T2

In [81]:
df1.join(df2, how = "outer") # df1 ve df2 arasında birleşim kümelerini alarak bir birleştirme işlemi yapmış olduk.Ortak indeksler üzerinde yer alan değerler birleşmiş oldu.
                             # Ancak DF içerisinde ortak olmayan indeksler üzerinde yer alan değerlerin karşılığı olmadığı için, otomatik olarak buralara NaN değer eklenerek sonuç almış olduk.

      X    Y    Z    T
A0   X0   Y0   Z0   T0
A1   X1   Y1  NaN  NaN
A2   X2   Y2   Z2   T2
A3  NaN  NaN   Z3   T3

In [84]:
df3 = pd.DataFrame({'key': ['X0', 'X2', 'X3', 'X4', 'X5', 'X6'],
                   'Y': ['Y0', 'Y2', 'Y3', 'Y4', 'Y5', 'Y6']})

df4 = pd.DataFrame({'key': ['X0', 'X2', 'X3'],
                      'Z': ['Z0', 'Z2', 'Z3']})

In [88]:
df3.join(df4) # df3 ve df4'te yer alan ortak sütun(column) olduğu için hata aldık.
              # Bu hatadan kurtulmak için join() fonks.parametrelerinde lsuffix="" ve rsuffix="" parametrelerini kullanarak ortak olan sütunun ismini değiştirerek birleştirme işlemini yapabiliriz.

ValueError: columns overlap but no suffix specified: Index(['key'], dtype='object')

In [108]:
df3.join(df4, lsuffix="_left", rsuffix = "_right",how = "inner") # Ortak olan sütunları, lsuffix ve rsuffix parametrelerini kullanarak yeniden tanımladık.
                                                                 # Böylelikle ortak sütunları değiştirerek hata almadan birleştirme işlemini yapmış olduk.

  key_left   Y key_right   Z
0       X0  Y0        X0  Z0
1       X2  Y2        X2  Z2
2       X3  Y3        X3  Z3

In [118]:
df3.set_index("key")

      Y
key
X0   Y0
X2   Y2
X3   Y3
X4   Y4
X5   Y5
X6   Y6

In [120]:
df3.set_index("key")

      Y
key
X0   Y0
X2   Y2
X3   Y3
X4   Y4
X5   Y5
X6   Y6

### NOT:

    Her iki DataFrame içerisinde yer alan ortak sütun değeri olan key sütununu, join() fonksiyonu ile birleştirme işlemi yaparken hata almamamız adına her iki DataFrame için set_index() fonksiyonunu kullanarak DataFrame'lerin indeksi haline getirmiş olduk.Devamında how="inner" parametresi ile bu iki DF içerisinde yer alan ortak satır değerleri üzerinden güzel bir şekilde birleştirme işlemi yapmış olduk.

In [128]:
df3.set_index("key").join(df4.set_index("key"), how= "inner")

      Y   Z
key
X0   Y0  Z0
X2   Y2  Z2
X3   Y3  Z3